'''
Сохраняем все введенные пользователем данные в context.user_data:

{
    'master': '',
    'service': '',
    'saloon': '',
    'date': '',
    'time': '',
    'full_name': '',
    'phone': '',
}

Затем на финальном шаге сохраняем данные в json на диске.
При входе в ЛК читаем из JSONа
'''

USERS = {
    'user_id': {
        'full_name': '',
        'phone': '',
        'orders': [
            {
                'master': '',
                'service': '',
                'saloon': '',
                'date': '',
                'time': '',
            },
            {
                'master': '',
                'service': '',
                'saloon': '',
                'date': '',
                'time': '',
            },
        ]
    }
}

SERVICES = {
    'service_1': 'стрижка',
    'service_2': 'бритье',
    'service_3': 'окрашивание',
    'service_4': 'маникюр',
    'service_5': 'педикюр',
}

MASTERS = {
    'master_1': {
        'name': 'Евгений',
        'saloons': ['saloon_1'],
    },
    'master_2': {
        'name': 'Александр',
        'saloons': ['saloon_1'],
    },
    'master_3': {
        'name': 'Екатерина',
        'saloons': ['saloon_1'],
    },
    'master_4': {
        'name': 'Иван',
        'saloons': ['saloon_1'],
    },
    'master_5': {
        'name': 'Владимир',
        'saloons': ['saloon_1'],
    },
    'master_6': {
        'name': 'Юлия',
        'saloons': ['saloon_1'],
    },
    'master_7': {
        'name': 'Виктория',
        'saloons': ['saloon_1'],
    },
    'master_8': {
        'name': 'Анна',
        'saloons': ['saloon_1'],
    },
    'master_9': {
        'name': 'Светлана',
        'saloons': ['saloon_1'],
    },
    'master_10': {
        'name': 'Ангелина',
        'saloons': ['saloon_1'],
    },
}

SALOONS = {
    'saloon_1': {
        'name': '',
        'masters': [],
    },
    'saloon_2': {
        'name': '',
        'masters': [],
    },
    'saloon_3': {
        'name': '',
        'masters': [],
    },
    'saloon_4': {
        'name': '',
        'masters': [],
    },
    'saloon_5': {
        'name': '',
        'masters': [],
    },
}

TIMESLOTS = {
    'master_1': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_2': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_3': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_4': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_5': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_6': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_7': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_8': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_9': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
    'master_10': {
        '13.08.2022': ['13:30', '14:00'],
        '14.08.2022': ['13:30', '14:00'],
    },
}
